#+STARTUP: content hideblocks
#+TODO: TASK(t!) | DONE(d) CANCEL(c)
#+TODO: BUG(b!) | FIXED(f) REJECT(r)

** DONE Перевести шифрование на AES в Linux
   CLOCK: [2016-06-22 Ср 10:33]--[2016-06-22 Ср 11:01] =>  0:28
   :PROPERTIES:
   :issue_id: 30
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:19
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

** DONE Добавить повторный просмотр писем без их повторной загрузки
   CLOSED: [2016-07-02 Сб 20:01]
   CLOCK: [2016-07-02 Сб 19:03]--[2016-07-02 Сб 20:00] =>  0:57
   :PROPERTIES:
   :issue_id: 6
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:19
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

** DONE [#A] Тесты для PasswordHandler с AES
   CLOCK: [2016-06-21 Вт 18:13]--[2016-06-21 Вт 20:12] =>  1:59
   :PROPERTIES:
   :issue_id: 14
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

** DONE Тесты для InputHandler
   CLOSED: [2016-07-22 Пт 17:35]
   CLOCK: [2016-07-22 Пт 16:34]--[2016-07-22 Пт 17:33] =>  0:59
   CLOCK: [2016-07-22 Пт 12:03]--[2016-07-22 Пт 13:25] =>  1:22
   CLOCK: [2016-07-21 Чт 16:06]--[2016-07-21 Чт 17:18] =>  1:12
   CLOCK: [2016-07-21 Чт 14:24]--[2016-07-21 Чт 14:46] =>  0:22
   CLOCK: [2016-07-16 Сб 17:08]--[2016-07-16 Сб 17:14] =>  0:06
   CLOCK: [2016-07-16 Сб 12:12]--[2016-07-16 Сб 12:17] =>  0:05
   :PROPERTIES:
   :issue_id: 18
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

   [2016-07-05 Вт]
   Есть [[issue_id34][задача]] по переделке методов InputHandler, нужно учесть её
   особенности при составлении тестов.

** DONE Тесты для ConnectionHandler
   CLOSED: [2016-07-09 Сб 10:40]
   CLOCK: [2016-07-09 Сб 09:32]--[2016-07-09 Сб 10:38] =>  1:06
   CLOCK: [2016-07-08 Пт 17:00]--[2016-07-08 Пт 17:41] =>  0:41
   - State "TASK"       from "DONE"       [2016-07-06 Ср 17:19]
   CLOCK: [2016-06-26 Вс 20:54]--[2016-06-26 Вс 21:11] =>  0:17
   CLOCK: [2016-06-26 Вс 19:15]--[2016-06-26 Вс 20:00] =>  0:45
   CLOCK: [2016-06-25 Сб 18:23]--[2016-06-25 Сб 18:55] =>  0:32
   :PROPERTIES:
   :issue_id: 31
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

   [2016-07-06 Ср]
   Дописать тесты, проверяющие диапазон сообщений. Так как тесты были
   изначально написаны для метода, у которого не было диапазона
   сообщений, то есть только те тесты, которые проверяют случаи при
   скачивании всех сообщений.

** DONE Тесты для ModesHandler
   CLOSED: [2016-07-11 Пн 19:58]
   CLOCK: [2016-07-11 Пн 19:04]--[2016-07-11 Пн 19:56] =>  0:52
   :PROPERTIES:
   :issue_id: 36
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

** DONE [#B] Добавить установку диапазона принимаемых писем
   CLOSED: [2016-07-11 Пн 15:36]
   CLOCK: [2016-07-11 Пн 15:01]--[2016-07-11 Пн 15:31] =>  0:30
   CLOCK: [2016-07-09 Сб 23:03]--[2016-07-09 Сб 23:31] =>  0:28
   CLOCK: [2016-07-06 Ср 23:11]--[2016-07-07 Чт 00:12] =>  1:01
   CLOCK: [2016-07-06 Ср 16:45]--[2016-07-06 Ср 17:37] =>  0:52
   CLOCK: [2016-07-06 Ср 14:20]--[2016-07-06 Ср 14:27] =>  0:07
   CLOCK: [2016-07-06 Ср 14:05]--[2016-07-06 Ср 14:19] =>  0:14
   CLOCK: [2016-07-05 Вт 19:09]--[2016-07-05 Вт 20:00] =>  0:51
   CLOCK: [2016-07-05 Вт 17:04]--[2016-07-05 Вт 17:15] =>  0:11
   CLOCK: [2016-07-05 Вт 13:34]--[2016-07-05 Вт 14:20] =>  0:46
   CLOCK: [2016-07-05 Вт 10:54]--[2016-07-05 Вт 11:36] =>  0:42
   CLOCK: [2016-07-05 Вт 00:10]--[2016-07-05 Вт 00:31] =>  0:21
   CLOCK: [2016-07-04 Пн 21:38]--[2016-07-04 Пн 22:28] =>  0:50
   CLOCK: [2016-07-04 Пн 19:43]--[2016-07-04 Пн 20:43] =>  1:00
   :PROPERTIES:
   :issue_id: 33
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

   [2016-07-04 Пн]

   Когда аккаунт выбран, нужно зайти куда-то и установить для него
   номер начального письма и номер конечного письма.
   Дальше выполняется обычная загрузка заголовков, которая учитывает
   эти настройки. По умолчанию должны грузиться письма с первого по
   последнее.
   Это даст возможность выбирать любую порцию писем в ящике: в начале,
   в середине или в конце.

   [2016-07-05 Вт]

   Неудобно угадывать сколько писем в ящике, чтобы устанавливать
   диапазон. Да и диапазон может вылазить за верхнюю границу
   количества писем. Когда диапазон вылазит, должно порождаться
   исключение с соответствующим сообщением в статусной строке.

** DONE Переделать методы в InputHandler
   CLOSED: [2016-07-21 Чт 14:04]
   CLOCK: [2016-07-16 Сб 18:18]--[2016-07-16 Сб 18:26] =>  0:08
   CLOCK: [2016-07-16 Сб 17:14]--[2016-07-16 Сб 18:14] =>  1:00
   :PROPERTIES:
   :issue_id: 34
   :issue_type: task
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

   [2016-07-05 Вт]

   - [ ] Строки приглашения должны устанавливаться в start().
   - [ ] Передача строк приглашения должна быть именованной.
   - [ ] По умолчанию строки приглашения должны быть пустыми.
   - [ ] В числовом вводе должен задаваться диапазон.
     В случае выхода из него при вводе должно порождаться исключение
     диапазона.

   Когда метод input_number() будет принимать диапазон, все места, где
   есть диапазон, надо переделать с учётом нового устройства метода.
   То есть, если раньше диапазон обрабатывался отдельно, то после
   переделки он должен подаваться прямо в метод и исключение должно
   порождаться в методе и распространяться выше.

** DONE [#D] Перевести шифрование на AES в Windows
   CLOSED: [2017-03-26 Вс 13:22]
   CLOCK: [2016-06-22 Ср 09:48]--[2016-06-22 Ср 09:56] =>  0:08
   :PROPERTIES:
   :issue_id: 2
   :issue_type: task
   :ARCHIVE_TIME: 2017-03-26 Вс 13:25
   :ARCHIVE_FILE: ~/prog/projects/python/checkmail/checkmail-lin/tasks/tasks.org
   :ARCHIVE_OLPATH: Задачи
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: DONE
   :END:

   В Windows шифрование через AES потребует установки модуля Crypto.
   Если модуль не ставится, программа должна работать без него (с отключённой
   функциональностью). Алгоритм xor слишком слабый, чтобы его оставлять.

   [2017-03-26 Вс]

   Так как проект разделён на Linux и Windows версии, файлы с задачами
   и багами стали индивидуальными, поэтому это задание закрывается как
   перешедшее в индивидуальный файл, находящийся в Windows-версии.

** FIXED [#A] В русской раскладке действия с вводом вызывают исключение
   CLOSED: [2016-06-30 Чт 18:20]
   CLOCK: [2016-06-30 Чт 17:31]--[2016-06-30 Чт 17:57] =>  0:26
   :PROPERTIES:
   :issue_id: 47
   :issue_type: bug
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Баги
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: FIXED
   :END:

   При Ctrl + D с введёнными русскими символами.

** FIXED [#A] В русской раскладке действия с паролем вызывают исключение
   CLOSED: [2016-06-30 Чт 18:24]
   CLOCK: [2016-06-30 Чт 17:58]--[2016-06-30 Чт 18:03] =>  0:05
   :PROPERTIES:
   :issue_id: 41
   :issue_type: bug
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Баги
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: FIXED
   :END:

   - [X] при вводе пароля при загрузке учётной записи
   - [X] при вводе пароля при сохранении в файл
   - [X] при русских символах в пароле при сохранении в файл

   [2016-06-29 Ср 01:43]

   Эта проблема возникает везде, где используется
   InputHandler.input_password().
   Поэтому нужно порождать соответствующее исключение, которое будет
   сообщать о неправильной раскладке.

** FIXED Проводится лишь одна попытка получения сообщения
   CLOSED: [2016-06-26 Вс 21:18]
   CLOCK: [2016-06-24 Пт 16:49]--[2016-06-24 Пт 18:08] =>  1:19
   CLOCK: [2016-06-24 Пт 12:20]--[2016-06-24 Пт 14:00] =>  1:40
   CLOCK: [2016-06-23 Чт 18:57]--[2016-06-23 Чт 20:53] =>  1:56
   CLOCK: [2016-06-23 Чт 17:01]--[2016-06-23 Чт 17:18] =>  0:17
   :PROPERTIES:
   :issue_id: 44
   :issue_type: bug
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Баги
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: FIXED
   :END:

   - [X] сделать три попытки
   - [X] добавить в список признак непринятого письма
   - [X] добавить в список признак принятого и нераскодированного письма
   - [X] сделать тесты для этих случаев

   [2016-06-23 Чт 17:18]

   Нужно переделать связку ConnectionHandler и Pop3Handler для того,
   чтобы сделать более умной обработку каждого сообщения. Сейчас
   Pop3Handler слишком комплексно обрабатывает заголовки (делает всё
   сразу), из-за чего невозможно туда вставить и три попытки приёма
   сообщения, и возврат ошибки в случае неудачи приёма, и возврат
   ошибки в случае неудачи раскодирования. Возможно, его метод нужно
   декомпозировать и сделать MessageHandler, который будет возвращать
   правильный кортеж на каждый из трёх случаев:
   - не принял
   - принял и не раскодировал
   - принял и раскодировал
   На каждом этапе он должен иметь возможность вставить какие-то
   действия. Например, если он не принял, он должен ещё раз
   попробовать, а если не раскодировал, должен попробовать другой
   алгоритм раскодирования.

** FIXED Не обрабатывается исключение при сохранении учётной записи в файл
   CLOSED: [2016-07-06 Ср 12:52]
   CLOCK: [2016-07-06 Ср 12:35]--[2016-07-06 Ср 12:51] =>  0:16
   :PROPERTIES:
   :issue_id: 8
   :issue_type: bug
   :ARCHIVE_TIME: 2016-12-16 Пт 19:20
   :ARCHIVE_FILE: ~/prog/projects/python/mail/prj/tasks/tasks.org
   :ARCHIVE_OLPATH: Баги
   :ARCHIVE_CATEGORY: tasks
   :ARCHIVE_TODO: FIXED
   :END:

   [2016-07-06 Ср]

   При Ctrl + D с пустым вводом выпадает EOFError и программа не
   обрабатывает его.

